//1.打印九九乘法表
//分析: 
// 外层控制行数  内层控制列数
// 九九乘法表一共9个数  1开始 一直到9
for (var i=1;i<=9;i++){
    var str=""
    for (var h=1;h<=i;h++)
    {
        str+=h + '*' + i + '=' + h * i + ' '
    }
    console.log(str)
}
for (var i=9;i>=1;i--)
{
  var str=""
    for (var h=1;h<=i;h++)
    {
        str+=h + '*' + i + '=' + h * i + ' '
    }
    console.log(str)
}

//2.打印闪电
for (var i=1;i<=3;i++)
{
    var str=""
    for(h=1;h<=i;h++)
    {
        str+="*"
    }
    console.log(str)
}

var str = ""
for (var i = 0; i < 7; i++) {
     str += "*"
 }
 console.log(str);

for (var i=3;i>=1;i--)
{
    var str=" "
    for(h=1;h<=i;h++)
    {
        str+="*"
    }
    console.log(str)
}

//3.打印下列图形

//4.打印金字塔
//5.	5文钱可以买一只公鸡，3文钱可以买一只母鸡，1文钱可以买3只雏鸡。现在用100文钱买100只鸡，那么各有公鸡、母鸡、雏鸡多少只？
//分析：
//1.先定义三个变量，分别代表公鸡，母鸡，和雏鸡的个数
//2.使用for循环嵌套，逐个尝试
//3.需满足两个条件 总数量为100，总钱数为100
//4.定义两个变量表示总数量，总钱数
var money=100,num=100
var a,b,c
for(a=0;a<=100;a++){
    for(b=0;b<=100;b++){
        for(c=0;c<=100;c++){
            if(num===a+b+c&& money===a*5+b*3+c/3){
                console.log(a,b,c)
            }

        }
    }
}
//6.	有一个棋盘，有64个方格，在第一个方格里面放1粒芝麻重量是0.00001kg，第二个里面放2粒，第三个里面放4，求棋盘上放的所有芝麻的重量

//7.	大马驮2石粮食，中马驮1石粮食，两头小马驮一石粮食，要用100匹马，驮100石粮食，该如何调配？
//分析
//1.定义三个变量，分别代表大马，中马，和小马的个数
//2.用for循环嵌套
//3.定义两个变量表示总马匹数，总粮食数
var  ma=100,liang=100
var e,f,g
for(e=0;e<=100;e++){
    for(f=0;f<=100;f++){
        for(g=0;g<=100;g++){
            if(liang===e+f+g&& ma===e*2+f*1+g/2){
                console.log(e,f,g)
            }

        }
    }
}
//8.	有1、2、3、4个数字，能组成多少个互不相同且无重复数字的三位数？有多少个，有哪些三位数？
//分析
//1.先定义三个变量，定义三位数的个，十，百
//2.使用for循环
var a,b,c,e,d=0//三位数总个数  e代表数字
for (a=1;a<=4;a++){
    for(b=1;b<=4;b++){
        for(c=1;c<=4;c++){
            if(a!=b && b!=c&&a!=c){
                e=a*100+b*10+c
                d=d+1
                console.log(e)
            }
        }
    }
}
console.log(d)

//9.	输入某年，某月，某日，判断这一天是一年中的第几天？


